{
  "name": "Rites",
  "icon": "miskatonicmysteries:chalk_goat",
  "category": "world",
  "sortnum": 5,
  "pages": [
    {
      "type": "text",
      "text": "Of course, one of the primary things an Entheator would be inclined to do is Rites. Rites are composed of four vital parts: the Octagram, the Knowledge, the Reagents, and the Foci. Rites are a delicate balance of power and stability, and even those experienced in other magics have difficulties in Rites of this unnature."
    },
    {
      "type": "text",
      "text": "To cast a Rite, several things are needed:$(li)The reagents needed for the Rite desired must be placed on an $(o)Octagram$(), $(li)The knowledge needed must be present, usually in the form of Research Notes or this book,$(li)The right amount of Focal Power must be present and $(li)The correct Great Old One must be addressed.$(br2)If all these cRiteria are met, the Rite will be cast more or less successfully."
    },
    {
      "type": "text",
      "text": "Logically, if a Rite is not vaguely successful, it will fail. The consequences of both success and failure are determined by a special factor -instability-, which will be elucidated later.$(br)In order for the Focal Power to be right, not too little nor too much should be present. If there is too little Focal Power, usually nothing will happen; however, if there is too much, the Rite will overload. This will also be elucidated later."
    },
    {
      "type": "text",
      "title": "Octagrams",
      "text": "Octagrams are a 3x3 meter wide 8-pointed star, with the sigil of a Great Old One drawn in the middle, often with other arcane symbols around it, to help focus energies. Octagrams are the centerpiece of Rites, as they channel the focal energy around them, sending them to their associated Great Old One to achieve the desired effects. For some Rites, the octagram is irrelevant; for other Rites, not using the correct octagram is lethal."
    },
    {
      "type": "image",
      "images": [
        "miskatonicmysteries:textures/gui/images/octagram.png"
      ],
      "border": true,
      "text": "To draw an Octagram, simply craft the matching $(l:world/items)$(marked)chalk$()."
    },
    {
      "type": "text",
      "title": "Reagents",
      "text": "If the Octagram is the heart of a Rite, the Reagents are its veins, pumping the blood through the skin of the world through their special constellation. The Reagents used determine the Rite that the caster attempts to perform, and reagents will be consumed if the rite is successful or overloads in some way.$(br)Usually, they don't contribute to the rite in any other way."
    },
    {
      "type": "text",
      "title": "The Knowledge",
      "text": "While Reagents are essential to determine the Rite cast, the fundamental Knowledge must of course be present, too. In order to contribute to a Rite with Knowledge, an $(l:world/blocks)$(marked)Altar$() must be placed nearby. The container of the Knowledge must then be placed on the Altar, and never be removed or closed while the Rite is cast, otherwise the Rite will be canceled. Do note that each Rite will automagically open the book when started."
    },
    {
      "type": "text",
      "title": "Focal Power",
      "text": "Focal Power is the strength with which the Rite will channel its Reagents towards the addressed Great Old One; too little will cause nothing to happen, too much will cause the Rite to overload and fail, consuming all Reagents in the process. To increase the Focal Power of a Rite, $(l:world/foci)$(marked)Foci$() must be held or placed nearby. Due to the complexity in Foci, these are elucidated in another entry."
    },
    {
      "type": "text",
      "title": "Success",
      "text": "If, as said, all criteria are met, the Rite will be cast successfully, consuming the Reagents and performing the desired effect, ideally. Additionally, some Rites may include an effect as they are cast. One thing however is important: finishing a Rite never eliminates side effects caused from too much instability."
    },
    {
      "type": "text",
      "title": "Primed Rites",
      "text": "Usually, a rite ends with it being cast; however, there are of course exceptions. These exceptions are called Primed Rites. Once the actual casting is complete, they will prime the Octagram to them. Once the Octagram is primed, the Rite may be released under the matching circumstances, like a player stepping on the octagram. "
    },
    {
      "type": "text",
      "text": "A primed Octagram will faintly glow and must not be sustained by any Foci et cetera. So it happens that Primed Rites are commonly used as traps, like one can see with the $(marked)Eldritch Trap$() and it's hellish equivalent."
    },
    {
      "type": "text",
      "title": "Malign Effects",
      "text": "A Rite can indeed go wrong in many many ways. As example, addressing the wrong Great Old One when the Great Old One addressed is relevant will possibly cause greater harm to the caster. Overloading the Rite will also contribute to similar effects and will consume all Reagents. Instability will always increase the possible severity of the effects, in addition to the possibility of after-effects on success."
    },
    {
      "type": "text",
      "title": "An Example",
      "text": "As this explanation of rites has been long and weary, an example on how to do it right -and one on how to do it wrong- will be given. In both examples the Primed Rite $(l:world/rites/rite_hysteria)$(marked)Hysteria$() will be performed, and the used setups will be shown."
    },
    {
      "type": "text",
      "text": "First, the needed reagents are added to the Octagram. In this case it does not matter what Octagram is used; this example uses an Octagram to the Black Goat.$(br)Then, the Altar is placed, along with the Necronomicon, as this is the book in which the information for the Hysteria Rite is contained. Additionally, Foci should be placed before the Rite is started; however, the descriptions of the Foci used will appear later in this example."
    },
    {
      "type": "text",
      "text": "If Reagents are missing or the wrong book is used, the Rite may not be started; instead, the Octagram will emit black smoke, as seen in the third picture.$(br)If the setup is valid, like the one in the first picture, more magic particles will appear.$(br)Do note that specifically the Hysteria Rite spawns the red swirls seen in picture two. Additionally, it should be remarked that some Rites have $(marked)special conditions$() in order to be started and cast; these are specified in the Rite's entry."
    },
    {
      "type": "image",
      "images": [
        "miskatonicmysteries:textures/gui/images/setup_valid.png",
        "miskatonicmysteries:textures/gui/images/setup_valid_active.png",
        "miskatonicmysteries:textures/gui/images/setup_invalid.png"
      ],
      "border": true,
      "text": "Setups for the Hysteria Rite. The setup in the third image is invalid."
    },
    {
      "type": "text",
      "text": "In order for the Rite to be successful, the right amount of Focal Power must be present. In the case of the Hysteria Rite, which only needs a lesser amount of Focal Power, the power of at least five candles and the Altar should be enough; however, many different setups are possible, like the one in picture two, where the caster placed a wither skull and holds an emerald (though the skull would probably be enough already)."
    },
    {
      "type": "image",
      "images": [
        "miskatonicmysteries:textures/gui/images/focus_enough_1.png",
        "miskatonicmysteries:textures/gui/images/focus_enough_2.png",
        "miskatonicmysteries:textures/gui/images/focus_not_enough.png",
        "miskatonicmysteries:textures/gui/images/focus_too_much.png"
      ],
      "border": true,
      "text": "Different Focus setups, from which only two are valid."
    },
    {
      "type": "text",
      "text": "As said before, too little Focal Power, like in picture three, will cause the Rite to fail without many side effects.$(br)While the setup in picture four probably holds almost enough power to call the fragment of a Great Old One, it is certainly too much for the Hysteria Rite. This would cause an overload.$(br)If the Focal Power is just right and the right amount of time elapsed - the amount of time may vary with each rite - the Rite will take effect."
    },
    {
      "type": "image",
      "images": [
        "miskatonicmysteries:textures/gui/images/rite_success.png",
        "miskatonicmysteries:textures/gui/images/rite_success_finish.png",
        "miskatonicmysteries:textures/gui/images/rite_fail.png"
      ],
      "border": true,
      "text": "Finished Rites; the first and second are a success the third one is an overload."
    },
    {
      "type": "text",
      "text": "In the special case of Primed Rites, like the Hysteria Rite, the effect will express in the Octagram glowing. Now, once someone steps on it, a mania-inducing wave will be released. $(br2)We hope that this example was enlightening."
    }
  ]
}