{
  "name": "Sanity",
  "icon": "miskatonicmysteries:tranquilizer",
  "category": "world",
  "sortnum": 8,
  "pages": [
    {
      "type": "text",
      "text": "To many, Sanity is a vital part of a healthy life, keeping the individual grounded and mentally stable.$(br)However, messing with powers beyond your comprehension is very damaging to Sanity, though some groups believe that Sanity is a wall that holds the mind back from unlocking its full potential, both mentally and sensually."
    },
    {
      "type": "text",
      "text": "Regardless, Insanity often comes with many less than pleasant side effects.$(br2)Insanity comes with many effects. Those affected report seeing and hearing things that may not exist, at least not in this plane, having the world around them distorted, to bursts of inhuman strength, as well as craving less than savoury foods. The lower a person’s Sanity is, the more intense and more frequent these effects will be."
    },
    {
      "type": "text",
      "text": "Curing Insanity is by no means an easy task.$(br)The most common way to do so is to take heavy sedatives such as Tranquilizers, acquired through trade, or to take Laudanum, oftentimes made by hand by the user. While Laudanum is easier to make, its effects are less powerful and the crude nature of it has a higher change to injure the user.  "
    },
    {
      "type": "crafting",
      "recipe": "miskatonicmysteries:laudanum",
      "text": "Tranquilizers, on the other hand, are more stable and must be taken before bed, though taking too strong a dose at too little of life can induce a sleep that one cannot wake from."
    },
    {
      "type": "text",
      "title": "Mania",
      "text": "Mania in many ways is a form of temporary, but extremely intense, insanity. As Mania originates from the mind rather than the body, milk cannot cure it, and the only known ways to cure it is using heavy sedatives or embracing it and letting it run its course."
    },
    {
      "type": "text",
      "title": "Exotic Substances",
      "text": "Some may wish to open their mind in other, safer ways. The safest way to do this is to take Blotters, produced as follows. However, some prefer the use of other substances, from concoctions of Belladonna and Mandrake and other foul ingredients, to Tinctures of an Arcane nature, and to burning a specific combination of Herbs."
    },
    {
      "type": "crafting",
      "recipe": "miskatonicmysteries:blotter",
      "text": "Taking any of these substances will induce Mania and may lower Sanity as a result. Other substances are also known, such as Flesh from the offspring of the Goat."
    }
  ]
}